# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary:  layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # Use MobileViTv2Backbone instead of original Conv/C3/CSP layers
  - [-1, 1, MobileViTv2Backbone, [1.0, [3, 4, 5], False]]  # outputs P3/8, P4/16, P5/32 (256,384,512 ch)
  - [-1, 1, SPPF, [512, 5]]       # updated: input 512 -> output 512
  - [-1, 2, C2PSA, [512]]        # two CSP layers on 512-ch input


head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]    # concat with P4 backbone feature (384 ch)
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 0], 1, Concat, [1]]    # concat with P3 backbone feature (256 ch)
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv,  [256, 3, 2]]
  - [[-1, 1], 1, Concat, [1]]    # concat with P4 backbone (384 ch) again
  - [-1, 2, C3k2, [512, False]]
  - [[-1, 2], 1, Concat, [1]]    # concat with P5 (512 ch) final feature
  - [-1, 2, C3k2, [512, True]]
  - [[12, 15, 17], 1, Detect, [nc]]  # Detect on P3/P4/P5 (channels 256, 512, 512)

