# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary:  layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# Backbone
backbone:
  - [-1, 1, MobileViTv2Backbone, [1.0, [3, 4, 5], False]]  # outputs list of 3 feature maps
  - [0, 1, Select, [0]]   # select P3 (stride 8, 256 channels)
  - [0, 1, Select, [1]]   # select P4 (stride 16, 384 channels)
  - [0, 1, Select, [2]]   # select P5 (stride 32, 512 channels)
  - [3, 1, SPPF, [512, 5]]  # SPPF on P5

# Neck + Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]  # concat upsampled P5 with P4
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]  # concat upsampled with P3
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 1], 1, Concat, [1]]  # concat downsampled with P4 again
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 1], 1, Concat, [1]]  # concat downsampled with P5 again
  - [-1, 2, C3k2, [512, True]]

  - [[8, 11, 14], 1, Detect, [nc]]  # Detect head on P3, P4, P5